[{"id":"Q1000","name":"Caeda's Target","rewardText":"This rewards Caeda's second playbook, Third Time. It puts a focused target on the third enemy. Make sure to equip the new playbook!","description":"Caeda is starting to think that her skills can be applied differently.  She could use some target practice.","heroName":"Caeda","hero1":"H204","hero2":"H203","hero3":"H202","hero4":"H201","hpLever":130000,"powLever":800,"unlockReq":"AL2024","reward":"PB0121"},{"id":"Q1001","name":"Troy's Benevolence","rewardText":"This rewards Troy's second playbook, Light Hug, which heals the entire adventurer group. Equip this playbook to use the new skill!","description":"Troy is considering a spell that allows him to help more people at once.  Try to locate it with him.","heroName":"Troy","hero1":"H104","hero2":"H103","hero3":"H102","hero4":"H101","hpLever":130000,"powLever":800,"unlockReq":"AL2025","reward":"PB0081"},{"id":"Q1100","name":"Beorn's Revenge","rewardText":"This rewards Beorn's second playbook, Revenge. Beorn will dodge and counterattack an enemy's attack. Remember to equip the playbook!","description":"Beorn has tracked down a lead, and has a settle to score.  Help him get Revenge.","heroName":"Beorn","hero1":"H001","hero2":"H002","hero3":"H003","hero4":"H004","hpLever":130000,"powLever":800,"unlockReq":"AL2026","reward":"PB0011"},{"id":"Q1101","name":"Neve's Storm","rewardText":"This rewards Neve's second playbook, Blizzard. Its new attack, Snowstorm, deals damage to all enemies. You must equip the playbook to use the skill!","description":"Neve wants to better control her Ice powers, and has learned about a powerful spell.","heroName":"Neve","hero1":"H102","hero2":"H203","hero3":"H104","hero4":"H101","hpLever":130000,"powLever":800,"unlockReq":"AL2027","reward":"PB0061"},{"id":"Q1200","name":"Caeda's Intuition","rewardText":"This rewards Caeda's third playbook, Back And Fourth. It puts a focused target on the fourth enemy. Don't forget to equip it!","description":"Caeda is convinced there is still more to learn about targeting.  Help her investigate.","heroName":"Caeda","hero1":"H204","hero2":"H203","hero3":"H202","hero4":"H201","hpLever":200000,"powLever":1100,"unlockReq":"AL2028","reward":"PB0122"},{"id":"Q1201","name":"Cedric's Pride","rewardText":"This rewards Cedric's second playbook, Intercept. Its new special skill, Righteousness, redirects enemy attacks at Cedric. Don't forget to equip it!","description":"Cedric believes that he alone can save his allies from harm.  Help him track down a new ability to do just that.","heroName":"Cedric","hero1":"H002","hero2":"H003","hero3":"H004","hero4":"H001","hpLever":200000,"powLever":1100,"unlockReq":"AL2029","reward":"PB0021"},{"id":"Q1300","name":"Zoe's Rage","rewardText":"This rewards Zoe's second playbook, Catastrophe, which has a single target special attack that also applies Scorch. Remember to equip it!","description":"Zoe is no longer interested in spreading out the damage; she wants to take down enemies one by one.","heroName":"Zoe","hero1":"H101","hero2":"H102","hero3":"H103","hero4":"H104","hpLever":200000,"powLever":1100,"unlockReq":"AL2030","reward":"PB0051"},{"id":"Q1301","name":"Titus's Trauma","rewardText":"This rewards Titus's second playbook, Outbreak. This playbook allows Titus to sap an ally behind him to apply Necrosis on an enemy.","description":"Titus has decided that in order to take down his enemies, his friends are all expendable.","heroName":"Titus","hero1":"H103","hero2":"H104","hero3":"H102","hero4":"H101","hpLever":200000,"powLever":1100,"unlockReq":"AL2031","reward":"PB0071"},{"id":"Q2000","name":"Alok's Hit","rewardText":"This rewards Alok's playbook, Song Of Strength. It gives a new skill, Madrigal, which allows Alok will boost the Power of his allies.","description":"Alok has become inspired to create a new song for his second album, and it's sure to be a hit.","heroName":"Alok","hero1":"H201","hero2":"H204","hero3":"H202","hero4":"H001","hpLever":430000,"powLever":1800,"unlockReq":"AL2032","reward":"PB0091"},{"id":"Q2001","name":"Grim's Reflection","rewardText":"This rewards Grim's second playbook, Blood Bond. Its special skill deals damage to an enemy and could also heal Grim under special circumstances.","description":"Grim has become introspective, realizing it may not be the best to hurt himself to cause damage.","heroName":"Grim","hero1":"H003","hero2":"H103","hero3":"H204","hero4":"H002","hpLever":430000,"powLever":1800,"unlockReq":"AL2033","reward":"PB0031"},{"id":"Q2100","name":"Revere's Opportunity","rewardText":"This rewards Revere's playbook, Cold Confidence. Her special skill will deal damage to the second enemy, and bonus damage if they are Chilled.","description":"Revere is always looking to come out on top, and she may have found a new angle to do just that.","heroName":"Revere","hero1":"H203","hero2":"H102","hero3":"H103","hero4":"H003","hpLever":430000,"powLever":1800,"unlockReq":"AL2034","reward":"PB0111"},{"id":"Q2101","name":"Grogmar's Pity","rewardText":"This rewards Grogmar's second playbook, Marked Target. The special attack, Flare, deals damage to the third enemy.","description":"Grogmar has developed a tricky thing for assassins: empathy.  He would like to end suffering as soon as possible.","heroName":"Grogmar","hero1":"H202","hero2":"H101","hero3":"H001","hero4":"H004","hpLever":430000,"powLever":1800,"unlockReq":"AL2035","reward":"PB0101"},{"id":"Q2200","name":"Alok's Return","rewardText":"This rewards Alok's third playbook, Song Of Pain. It increases the damage enemies take for one attack.","description":"Alok is looking for critical acclaim, so he's seeking inspiration for a new song about heartbreak.","heroName":"Alok","hero1":"H201","hero2":"H002","hero3":"H101","hero4":"H001","hpLever":580000,"powLever":2500,"unlockReq":"AL2036","reward":"PB0092"},{"id":"Q2201","name":"Lambug's Lethargy","rewardText":"This rewards Lambug's playbook, Waning Blows. Its special skill deals heavy damage, but damage done decreases each time it is used.","description":"Lambug is incredibly out of shape, and to have the impact they want, they often tire out quickly.","heroName":"Lambug","hero1":"H004","hero2":"H104","hero3":"H204","hero4":"H101","hpLever":580000,"powLever":2500,"unlockReq":"AL2037","reward":"PB0041"},{"id":"Q2300","name":"Cedric's Ego","rewardText":"This rewards Cedric's third playbook, Fall From Grace. The special skill in this playbook decreases Cedric's health and increases his attack.","description":"Cedric is convinced that he alone can save the realm, and wants a skill to reflect that belief.","heroName":"Cedric","hero1":"H002","hero2":"H102","hero3":"H202","hero4":"H201","hpLever":580000,"powLever":2500,"unlockReq":"AL2038","reward":"PB0022"},{"id":"Q2301","name":"Neve's Chamber","rewardText":"This rewards Neve's third playbook, Cold As Ice. Using this playbook's new special skill makes Neve immune from damage until her next turn.","description":"Neve is afraid of what her powers may become, and is looking for a way to protect herself.","heroName":"Neve","hero1":"H102","hero2":"H002","hero3":"H104","hero4":"H003","hpLever":580000,"powLever":2500,"unlockReq":"AL2039","reward":"PB0062"},{"id":"Q3000","name":"Troy's Bequeathal","rewardText":"This rewards Troy's third playbook, Light Connection. It has a new special attack, Regen, which heals the frontmost ally every time they take a turn.","description":"Troy is looking to increase the effectiveness of his healing, and has an idea about how to do so.","heroName":"Troy","hero1":"H104","hero2":"H002","hero3":"H201","hero4":"H001","hpLever":3400,"powLever":900000,"unlockReq":"AL2040","reward":"PB0082"},{"id":"Q3001","name":"Beorn's Redemption","rewardText":"This rewards Beorn's third playbook, Stay Behind Me. This playbook allows Beorn to redirect some of his group's damage to himself instead.","description":"Beorn has learned that revenge may not be the best path towards healing, and is looking to protect his allies better.","heroName":"Beorn","hero1":"H001","hero2":"H103","hero3":"H202","hero4":"H201","hpLever":3400,"powLever":900000,"unlockReq":"AL2041","reward":"PB0012"},{"id":"Q3100","name":"Grim's Consideration","rewardText":"This rewards Grim's third playbook, Bloodbath. Its special attack, Blood Cleave, deals damage to two enemies at the expense of Grim's health.","description":"Grim wants to learn how to deal with two enemies at once, in order to become a more balanced fighter.","heroName":"Grim","hero1":"H003","hero2":"H102","hero3":"H203","hero4":"H004","hpLever":3400,"powLever":900000,"unlockReq":"AL2042","reward":"PB0032"},{"id":"Q3101","name":"Titus's Ruin","rewardText":"This rewards Titus's third playbook, Pandemic. Titus applies Necrosis to everyone, friends and foes alike, when using this playbook.","description":"Titus is no longer looking to harm individuals.  He wants to see the whole realm in chaos.","heroName":"Titus","hero1":"H103","hero2":"H004","hero3":"H204","hero4":"H003","hpLever":3400,"powLever":900000,"unlockReq":"AL2043","reward":"PB0072"},{"id":"Q3200","name":"Lambug's Vigor","rewardText":"This rewards Lambug's playbook, Overexcited. Its special attack, Amped Up, deals more damage each time it is used.","description":"Lambug has gotten back in shape, and is now able to ramp up her abilities as the fights go on.","heroName":"Lambug","hero1":"H004","hero2":"H003","hero3":"H203","hero4":"H001","hpLever":4700,"powLever":1380000,"unlockReq":"AL2044","reward":"PB0042"},{"id":"Q3201","name":"Revere's Gamble","rewardText":"This rewards Revere's playbook, Better Than Good. It gives a quirky new special attack that deals bonus damage in specific conditions.","description":"Revere has become even more reckless, looking to take big chances to land huge scores.","heroName":"Revere","hero1":"H203","hero2":"H202","hero3":"H201","hero4":"H204","hpLever":4700,"powLever":1380000,"unlockReq":"AL2045","reward":"PB0112"},{"id":"Q3300","name":"Grogmar's Apathy","rewardText":"This rewards Grogmar's third playbook, Smug Target. It deals damage to the fourth enemy, and bonus damage if they are at full health.","description":"Grogmar quickly became disillusioned, and now attacks with indifference to the consequences his actions cause.","heroName":"Grogmar","hero1":"H202","hero2":"H203","hero3":"H002","hero4":"H004","hpLever":4700,"powLever":1380000,"unlockReq":"AL2046","reward":"PB0102"},{"id":"Q3301","name":"Zoe's Fury","rewardText":"This rewards Zoe's third playbook, Cataclysm. Zoe focuses her energy for two turns, dealing huge damage on her third.","description":"Zoe wants to deal great amounts of pain on her enemy, and doesn't care how long it takes to do so.","heroName":"Zoe","hero1":"H101","hero2":"H204","hero3":"H103","hero4":"H104","hpLever":4700,"powLever":1380000,"unlockReq":"AL2047","reward":"PB0052"}]